Tekla Open API Reference for Tekla Structures 2025
DrawingItem.Select Method
 Selects the drawing item in the drawing catalog.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string Name
)
Public Function Select (
	Name As String
) As Boolean
Parameters
Name
Type: System.String
The Name of the drawing item to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
DrawingItem Class
Tekla.Structures.Catalogs Namespace